org/blog.org
#+title: ORG Content
#+author: Victor Dorneanu
#+startup: indent fold
#+hugo_base_dir: ../
#+hugo_section: posts
#+hugo_auto_set_lastmod: t
#+hugo_paired_shortcodes: %sidenote
#+property: header-args :eval never-export

#+macro: zk [[https://brainfck.org/#$1][$2]]
#+macro: bib [[https://brainfck.org/bib.html#$1][$2]]
#+macro: relref @@hugo:[@@ $1 @@hugo:]({{< relref "$2" >}})@@
#+macro: titleref @@hugo:{{< titleref "$1" "@@ $2 @@hugo:" >}}@@


** Security
:PROPERTIES:
:EXPORT_FILE_NAME: security
:END:
*** Pentest
**** Checklists
- [[https://six2dez.gitbook.io/pentest-book/others/web-checklist][six2dez.gitbook.io/pentest-book/others/web-checklist]]
- [[https://gbhackers.com/web-application-penetration-testing-checklist-a-detailed-cheat-sheet/][Web Application Penetration Testing Checklist – A Detailed Cheat Sheet]]
  - Information Gathering
  - Authentication
  - Authorization
  - Configuration Management
  - Session Management
  - DoS
  -
*** Application Security
**** [[https://application.security/][Application Security Training For Developers | Kontra]]
:PROPERTIES:
:TIMESTAMP: <2021-03-02 Tue>
:END:
All kind of appsec related simulations/trainings.
*** Offensive
- [[https://secret.club/][secret club | We Break Software]]
