content/bookmarks/security.md
+++
title = "Security"
author = ["Victor Dorneanu"]
lastmod = 2021-05-18T10:41:58+02:00
tags = ["bookmark"]
draft = false
weight = 2004
toc = true
noauthor = true
nocomment = true
nodate = true
nopaging = true
noread = true
+++

## Pentest {#pentest}


### Checklists {#checklists}

-   [six2dez.gitbook.io/pentest-book/others/web-checklist](https://six2dez.gitbook.io/pentest-book/others/web-checklist)
-   [Web Application Penetration Testing Checklist – A Detailed Cheat Sheet](https://gbhackers.com/web-application-penetration-testing-checklist-a-detailed-cheat-sheet/)
    -   Information Gathering
    -   Authentication
    -   Authorization
    -   Configuration Management
    -   Session Management
    -   DoS
    -


## Application Security {#application-security}


### [Application Security Training For Developers | Kontra](https://application.security/) {#application-security-training-for-developers-kontra}

All kind of appsec related simulations/trainings.


## Offensive {#offensive}

-   [secret club | We Break Software](https://secret.club/)
